Examinator/src/Documents/ПопыткаВыполненияЗаданияСУО/ПопыткаВыполненияЗаданияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПопыткаВыполненияЗаданияСУО</name>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЗаданийСУО</registerRecords>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вариант</name>
    <type>
      <types>CatalogRef.ВариантыЗаданийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозвратаНаДоработку</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиНаПроверку</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозвратаНаДоработку</name>
    <type>
      <types>CatalogRef.ПричиныВозвратаЗаданияНаДоработкуСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверившийПреподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяющийПреподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивностиПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнойБалл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДоступаКЗаданию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоступаКЗаданию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьВремяДоступаКЗаданию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Examinator/src/InformationRegisters/ПопыткиПрохожденияЗаданийСУО/ПопыткиПрохожденияЗаданийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПопыткиПрохожденияЗаданийСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиНаПроверку</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вариант</name>
    <type>
      <types>CatalogRef.ВариантыЗаданийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозвратаНаДоработку</name>
    <type>
      <types>CatalogRef.ПричиныВозвратаЗаданияНаДоработкуСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозвратаНаДоработку</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Значимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнойБалл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеЖдатьПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверившийПреподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДоступаКЗаданию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоступаКЗаданию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьВремяДоступаКЗаданию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ПН/ДанныеВебКабинетаСУО_ПН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ПН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПроведенияОбъектовСУО/СтатусыПроведенияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроведенияОбъектовСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ПриОтсутствииОценкиЗаЗаданиеСУО/ПриОтсутствииОценкиЗаЗаданиеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПриОтсутствииОценкиЗаЗаданиеСУО</name>
  <enumValues>
    <name>БезОценки</name>
  </enumValues>
  <enumValues>
    <name>МаксимальныйБалл</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыДанныхВебКабинетаСУО/ТипыДанныхВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхВебКабинетаСУО</name>
  <enumValues>
    <name>УчебнаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>РезультатыТестирования</name>
  </enumValues>
  <enumValues>
    <name>УчастникОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеЗаявки</name>
  </enumValues>
  <enumValues>
    <name>РазделФорума</name>
  </enumValues>
  <enumValues>
    <name>РазделФорумаОписание</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщения</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщенияОписание</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОписание</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>БиблиотекаПользователя</name>
  </enumValues>
  <enumValues>
    <name>Новость</name>
  </enumValues>
  <enumValues>
    <name>НовостьОписание</name>
  </enumValues>
  <enumValues>
    <name>КнигаОписание</name>
  </enumValues>
  <enumValues>
    <name>КаталогПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПользовательОписание</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппаОписание</name>
  </enumValues>
  <enumValues>
    <name>ФайлУчащегося</name>
  </enumValues>
  <enumValues>
    <name>ПреподавателиПользователя</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>ОценкиКачестваОбучения</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ФорматыВебДанныхСУ/ФорматыВебДанныхСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыВебДанныхСУ</name>
  <enumValues>
    <name>xml</name>
  </enumValues>
  <enumValues>
    <name>json</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПопыткаВыполненияЗаданияСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция Отменено(ПопыткаВыполненияЗадания) Экспорт
	
	Если ТипЗнч(ПопыткаВыполненияЗадания) = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО") Тогда
		ПопыткаВыполненияЗаданияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПопыткаВыполненияЗадания, "ПрохождениеОбучения, Отменено");
	Иначе
		ПопыткаВыполненияЗаданияСвойства = ПопыткаВыполненияЗадания;
	КонецЕсли;
	
	Если ПопыткаВыполненияЗаданияСвойства.Отменено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Документы.ПрохождениеОбученияСУО.Отменено(ПопыткаВыполненияЗаданияСвойства.ПрохождениеОбучения);
	
КонецФункции

Функция Представление(ПопыткаВыполненияЗадания) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПопыткаВыполненияЗадания) Тогда
		Возврат "";
	КонецЕсли;
	
	ДанныеПопыткаВыполненияЗадания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПопыткаВыполненияЗадания, "ПрохождениеОбучения, Задание, Дата");
	
	НаименованиеЗадания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПопыткаВыполненияЗадания.Задание, "Наименование");
	
	Возврат Строка(Документы.ПрохождениеОбученияСУО.Представление(ДанныеПопыткаВыполненияЗадания.ПрохождениеОбучения)) + " - " + Строка(НаименованиеЗадания) + " - " + Строка(Формат(ДанныеПопыткаВыполненияЗадания.Дата, "ДЛФ=D"));
	
КонецФункции

// Проверяет, выполнено ли задание.
// Выполненным считается задание, которое завершено,
// т.е. сделано пользователем с проходным баллом
// и если оно требует проверки, то и проверено.
//
Функция Выполнено(ПопыткаВыполненияЗадания, ПопыткаЗавершена, ПроверяетсяПреподавателем, ПроверенПреподавателем, Баллы, ПроходнойБалл, ДатаОкончанияДоступаКЗаданию) Экспорт
	
	Если ЗначениеЗаполнено(ДатаОкончанияДоступаКЗаданию)
		И ДатаОкончанияДоступаКЗаданию < ТекущаяДатаСеанса() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПопыткаВыполненияЗадания) Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	ПопыткаЗавершенаСПроходнымБаллом = (ПопыткаЗавершена И Баллы >= ПроходнойБалл);
	
	Если ПроверяетсяПреподавателем Тогда
		Возврат (ПроверенПреподавателем И ПопыткаЗавершенаСПроходнымБаллом);		
	Иначе			
		Возврат ПопыткаЗавершенаСПроходнымБаллом;		
	КонецЕсли;
	
КонецФункции

Функция ПолученаОценка(Знач ПопыткаВыполненияЗадания, Знач ПопыткаЗавершена, Знач ПроверяетсяПреподавателем, Знач ПроверенПреподавателем, Знач ДатаОкончанияДоступаКЗаданию, Знач ВыставляетсяОценка) Экспорт
	
	Если НЕ ВыставляетсяОценка Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПопыткаВыполненияЗадания) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПопыткаЗавершена И ПроверяетсяПреподавателем И НЕ ПроверенПреподавателем Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОкончанияДоступаКЗаданию)
		И ДатаОкончанияДоступаКЗаданию < ТекущаяДатаСеанса() Тогда
		Возврат Истина;
	КонецЕсли;
		
	Если ПроверяетсяПреподавателем Тогда
		Возврат (ПроверенПреподавателем И ПопыткаЗавершена);		
	Иначе			
		Возврат ПопыткаЗавершена;		
	КонецЕсли;
	
КонецФункции

Функция ОценкаЗаЗадание(Знач ПопыткаВыполненияЗадания) Экспорт
	
	ДанныеПопытки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПопыткаВыполненияЗадания, "ПроведениеОбучения, ПопыткаЗавершена, Баллы, ПроверяетсяПреподавателем, ПроверенПреподавателем, ДатаОкончанияДоступаКЗаданию, ВыставляетсяОценка");
	
	Если НЕ ПолученаОценка(ПопыткаВыполненияЗадания, ДанныеПопытки.ПопыткаЗавершена, ДанныеПопытки.ПроверяетсяПреподавателем, ДанныеПопытки.ПроверенПреподавателем, ДанныеПопытки.ДатаОкончанияДоступаКЗаданию, ДанныеПопытки.ВыставляетсяОценка) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ШкалаОценки = Документы.ПроведениеОбученияСУО.ШкалаОценки(ДанныеПопытки.ПроведениеОбучения);
	ДанныеОценки = Справочники.ШкалыОценокСУО.ОценкаИзБаллов(ДанныеПопытки.Баллы, ШкалаОценки, Истина);
	
	Возврат ДанныеОценки;
	
КонецФункции

Функция ПопыткиВыполненияЗаданий(ПрохождениеОбучения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткиПрохожденияЗаданийСУО.Регистратор КАК ПопыткаВыполненияЗадания,
		|	ПопыткиПрохожденияЗаданийСУО.ВыставляетсяОценка КАК ВыставляетсяОценка
		|ИЗ
		|	РегистрСведений.ПопыткиПрохожденияЗаданийСУО КАК ПопыткиПрохожденияЗаданийСУО
		|ГДЕ
		|	ПопыткиПрохожденияЗаданийСУО.ПрохождениеОбучения = &ПрохождениеОбучения";

	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция ФайлыШаблонаЗадания(ПопыткаВыполненияЗадания) Экспорт
	
	Если ТипЗнч(ПопыткаВыполненияЗадания) = Тип("ДокументСсылка.ПопыткаВыполненияЗаданияСУО") Тогда
		ПопыткаВыполненияЗаданияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПопыткаВыполненияЗадания, "Задание, Вариант");
	Иначе
		ПопыткаВыполненияЗаданияСвойства = ПопыткаВыполненияЗадания;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.ДатаСоздания КАК ДатаСоздания,
		|	Файлы.Наименование КАК Наименование,
		|	Файлы.Описание КАК Описание,
		|	Файлы.Ссылка КАК Файл,
		|	Файлы.Расширение КАК Расширение,
		|	Файлы.Размер КАК Размер
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &Владелец
		|	И Файлы.ПометкаУдаления = ЛОЖЬ";
		
		
	Если ЗначениеЗаполнено(ПопыткаВыполненияЗаданияСвойства.Вариант) Тогда
		Запрос.УстановитьПараметр("Владелец", ПопыткаВыполненияЗаданияСвойства.Вариант);
	Иначе
		Запрос.УстановитьПараметр("Владелец", ПопыткаВыполненияЗаданияСвойства.Задание);
	КонецЕсли;	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ФайлыПрохожденияЗадания(ПопыткаВыполненияЗадания) Экспорт
	
	МассивФайлов = Новый Массив;
	
	Если ЗначениеЗаполнено(ПопыткаВыполненияЗадания) Тогда
		ПрисоединенныеФайлы.ПолучитьПрикрепленныеФайлыКОбъекту(ПопыткаВыполненияЗадания, МассивФайлов);
	КонецЕсли;
	
	Возврат МассивФайлов;
		
КонецФункции

Функция ДанныеОПрохожденииЗаданий(ПрохождениеОбучения, ТаблицаЗаданий, Сценарий, ВидОбучения) Экспорт
	
	ДанныеОПрохождении = Новый Структура(
		"Баллы,
		|ТекущиеБаллы,
		|ЗавершеноВПроцентах,
		|ПроверяетсяПреподавателем,
		|ПроверенПреподавателем,
		|ВозвращеноНаДоработку,
		|МожноЗавершатьАвтоматически,
		|ВыставляетсяОценка",
		0,
		0,
		0,
		Ложь,
		Ложь,
		Ложь,
		Ложь,
		Ложь);
	
	// Получаем все попытки прохождения всех заданий

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткиПрохожденияЗаданийСУО.Баллы КАК Баллы,
		|	ПопыткиПрохожденияЗаданийСУО.Регистратор КАК ПопыткаВыполненияЗадания,
		|	ПопыткиПрохожденияЗаданийСУО.ПроверяетсяПреподавателем КАК ПроверяетсяПреподавателем,
		|	ПопыткиПрохожденияЗаданийСУО.ПроверенПреподавателем КАК ПроверенПреподавателем,
		|	ПопыткиПрохожденияЗаданийСУО.ПопыткаЗавершена КАК ПопыткаЗавершена,
		|	ПопыткиПрохожденияЗаданийСУО.Задание КАК Задание,
		|	ПопыткиПрохожденияЗаданийСУО.Период КАК Дата,
		|	ПопыткиПрохожденияЗаданийСУО.ВозвращеноНаДоработку КАК ВозвращеноНаДоработку,
		|	ПопыткиПрохожденияЗаданийСУО.ЗавершеноВПроцентах КАК ЗавершеноВПроцентах,
		|	ПопыткиПрохожденияЗаданийСУО.ПроходнойБалл КАК ПроходнойБалл,
		|	ПопыткиПрохожденияЗаданийСУО.НеЖдатьПроверки КАК НеЖдатьПроверки,
		|	ПопыткиПрохожденияЗаданийСУО.ДатаОкончанияДоступаКЗаданию КАК ДатаОкончанияДоступаКЗаданию,
		|	ПопыткиПрохожденияЗаданийСУО.ВыставляетсяОценка КАК ВыставляетсяОценка
		|ИЗ
		|	РегистрСведений.ПопыткиПрохожденияЗаданийСУО КАК ПопыткиПрохожденияЗаданийСУО
		|ГДЕ
		|	ПопыткиПрохожденияЗаданийСУО.ПрохождениеОбучения = &ПрохождениеОбучения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";

	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);

	Результат = Запрос.Выполнить();

	ТаблицаПрохожденийЗаданий = Результат.Выгрузить();
	ТаблицаПрохожденийЗаданий.Индексы.Добавить("Задание");	
	
	// Удаляем из таблицы прохождений лишние попытки, если 
	// кто-то сделал вторую попытку, удалив предыдущую,
	// а потом ее вернул. Оставляем на каждое задание по
	// одной попытке.

	МассивСтрокСАктуальнымиПопытками = Новый Массив();	
		
	Для каждого СтрокаТЗ Из ТаблицаЗаданий Цикл
		
		АктуальнаяПопытка = Неопределено;
		
		Для каждого Строка Из ТаблицаПрохожденийЗаданий Цикл
			
			Если Строка.Задание <> СтрокаТЗ.Задание Тогда
				Продолжить;
			КонецЕсли;					
				
			Если АктуальнаяПопытка = Неопределено ИЛИ АктуальнаяПопытка.Дата < Строка.Дата Тогда
				АктуальнаяПопытка = Строка;
			КонецЕсли;
							
		КонецЦикла;
		
		Если АктуальнаяПопытка <> Неопределено Тогда
			МассивСтрокСАктуальнымиПопытками.Добавить(АктуальнаяПопытка);
		КонецЕсли;

	КонецЦикла;	

	Индекс = ТаблицаПрохожденийЗаданий.Количество() - 1;
		
	Пока Индекс >= 0 Цикл

		Строка = ТаблицаПрохожденийЗаданий.Получить(Индекс);
		
		Если МассивСтрокСАктуальнымиПопытками.Найти(Строка) = Неопределено Тогда
			ТаблицаПрохожденийЗаданий.Удалить(Строка);
		КонецЕсли;
		
		Индекс = Индекс - 1;
		
	КонецЦикла;
	
	// Считаем данные о прогрессе и баллы
	
	МаксимальныйПрогресс = 0;
	РеальныйПрогресс = 0;
	МожноЗавершатьАвтоматически = Истина;
	МаксимумБаллов = 0;
	МаксимумТекущихБаллов = 0;
	НабранноеКоличествоБаллов = 0;
	ЕстьВозвращеныеНаДоработку = Ложь;
	ЕстьПроверяемыеПреподавателем = Ложь;
	ВсеПровереноПреподавателем = Истина;
	ВыставляетсяОценкаЗаЗадания = Ложь;
	
	ЗаданияПроверяютсяВыборочно = Справочники.ВидыМероприятийСУО.ЗаданияПроверяютсяВыборочно(ВидОбучения);
	
	Для каждого Строка Из ТаблицаЗаданий Цикл
		
		ЗначимостьЗадания = Строка.Значимость;		
		МаксимальныйПрогресс = МаксимальныйПрогресс + 100;		
		ПопыткаВыполненияЗадания = Неопределено;
		ПопыткаЗавершена = Ложь;
		ПроверяетсяПреподавателем = Ложь;
		ПроверенПреподавателем = Ложь;
		ДатаОкончанияДоступаКЗаданию = Строка.ДатаОкончанияДоступаКЗаданию;
		Баллы = 0;
		ЗавершеноВПроцентах = 0;
		ПроходнойБалл = Строка.ПроходнойБалл;
		ВозвращеноНаДоработку = Ложь;
		ВыставляетсяОценка = Строка.ВыставляетсяОценка;
		
		СтрокаТПЗ = ТаблицаПрохожденийЗаданий.Найти(Строка.Задание, "Задание");
		
		Если СтрокаТПЗ <> Неопределено Тогда
			ПопыткаВыполненияЗадания = СтрокаТПЗ.ПопыткаВыполненияЗадания;
			ПопыткаЗавершена = СтрокаТПЗ.ПопыткаЗавершена;
			ПроверяетсяПреподавателем = СтрокаТПЗ.ПроверяетсяПреподавателем;
			ПроверенПреподавателем = СтрокаТПЗ.ПроверенПреподавателем;
			ДатаОкончанияДоступаКЗаданию = СтрокаТПЗ.ДатаОкончанияДоступаКЗаданию;
			Баллы = СтрокаТПЗ.Баллы;
			ЗавершеноВПроцентах = СтрокаТПЗ.ЗавершеноВПроцентах;
			ВозвращеноНаДоработку = СтрокаТПЗ.ВозвращеноНаДоработку;
			ВыставляетсяОценка = СтрокаТПЗ.ВыставляетсяОценка;
		КонецЕсли;
		
		Если НЕ ВыставляетсяОценка Тогда
			ЗначимостьЗадания = 0;
		КонецЕсли;
		
		Если ВыставляетсяОценка Тогда
			ВыставляетсяОценкаЗаЗадания = Истина;	
		КонецЕсли;
		
		// Если это задание на проверку и оно не завершено,
		// то мы не считаем, что оно проверяется преподавателем
		// до тех пор, пока оно не будет завершено		
		Если ТипЗнч(Строка.Задание) = Тип("СправочникСсылка.ЗаданияСУО") И НЕ ПопыткаЗавершена Тогда
			ПроверяетсяПреподавателем = Ложь;
		КонецЕсли;
				
		Если ПроверяетсяПреподавателем Тогда
			ЕстьПроверяемыеПреподавателем = Истина;
		КонецЕсли;
		
		Если ПроверяетсяПреподавателем И НЕ ПроверенПреподавателем Тогда
			ВсеПровереноПреподавателем = Ложь;
		КонецЕсли;			
		
		Если ВозвращеноНаДоработку Тогда
			ЕстьВозвращеныеНаДоработку = Истина;
		КонецЕсли;
		
		ПолученаОценкаЗаЗадание = ПолученаОценка(ПопыткаВыполненияЗадания, ПопыткаЗавершена, ПроверяетсяПреподавателем, ПроверенПреподавателем, ДатаОкончанияДоступаКЗаданию, Строка.ВыставляетсяОценка);
				
		Если ПолученаОценкаЗаЗадание И ВыставляетсяОценка Тогда
			Если ПопыткаЗавершена Тогда
				ЗавершеноВПроцентах = 100;
			КонецЕсли;
			НабранноеКоличествоБаллов = НабранноеКоличествоБаллов + ЗначимостьЗадания * Баллы;
			МаксимумТекущихБаллов = МаксимумТекущихБаллов + ЗначимостьЗадания * 100;
			МаксимумБаллов = МаксимумБаллов + ЗначимостьЗадания * 100;
		КонецЕсли;
		
		РеальныйПрогресс = РеальныйПрогресс + ЗавершеноВПроцентах;
		
		// Определяем, можно ли завершать автоматически.
		// Завершать автоматически можно, когда все
		// задания выполнены (включая просроченные),
		// а те, что проверяются проверены,
		// кроме тех, что проверяются выборочно
		// и в выполненных набран проходной балл.
		
		ЖдатьПроверкиЗадания = ?(НЕ ЗаданияПроверяютсяВыборочно И НЕ Строка.НеЖдатьПроверки, Истина, Ложь);
		
		Если (НЕ ПолученаОценкаЗаЗадание И ВыставляетсяОценка И ЖдатьПроверкиЗадания) ИЛИ ЗавершеноВПроцентах <> 100 Тогда
			МожноЗавершатьАвтоматически = Ложь;
		КонецЕсли;
		
		Если ЖдатьПроверкиЗадания
			И ПопыткаЗавершена
			И ПроверяетсяПреподавателем 
			И НЕ ПроверенПреподавателем Тогда
			
			МожноЗавершатьАвтоматически = Ложь;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПроходнойБалл) 
			И Баллы < ПроходнойБалл Тогда
		
			МожноЗавершатьАвтоматически = Ложь;
			
		КонецЕсли;
	
	КонецЦикла;
	
	ДанныеОПрохождении.ВозвращеноНаДоработку = ЕстьВозвращеныеНаДоработку;
	ДанныеОПрохождении.ПроверяетсяПреподавателем = ЕстьПроверяемыеПреподавателем;
	ДанныеОПрохождении.ПроверенПреподавателем = ВсеПровереноПреподавателем;
	ДанныеОПрохождении.ВыставляетсяОценка = ВыставляетсяОценкаЗаЗадания;
	
	Если НЕ ДанныеОПрохождении.ПроверяетсяПреподавателем Тогда
		ДанныеОПрохождении.ПроверенПреподавателем = Ложь;
	КонецЕсли;		
		
	Если МаксимальныйПрогресс > 0 Тогда
		ДанныеОПрохождении.ЗавершеноВПроцентах = Окр(( РеальныйПрогресс / МаксимальныйПрогресс )*100);
	Иначе
		ДанныеОПрохождении.ЗавершеноВПроцентах = 100; // Нет заданий
	КонецЕсли;	
	
	Если МаксимумБаллов > 0 Тогда 		
		ДанныеОПрохождении.Баллы = Окр((НабранноеКоличествоБаллов / МаксимумБаллов)*100);		
	Иначе		
		ДанныеОПрохождении.Баллы = 0; // Нет заданий
	КонецЕсли;	
	
	Если МаксимумТекущихБаллов > 0 Тогда 		
		ДанныеОПрохождении.ТекущиеБаллы = Окр((НабранноеКоличествоБаллов / МаксимумТекущихБаллов)*100);		
	Иначе		
		ДанныеОПрохождении.ТекущиеБаллы = 0; // Нет заданий		
	КонецЕсли;
	
	ДанныеОПрохождении.МожноЗавершатьАвтоматически = МожноЗавершатьАвтоматически;
	
	Возврат ДанныеОПрохождении;
	
КонецФункции

Функция СценарийОбучения(Знач ПопыткаВыполненияЗадания, ПрохождениеОбучения = Неопределено) Экспорт
	
	Если ПрохождениеОбучения = Неопределено Тогда
		ПрохождениеОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПопыткаВыполненияЗадания, "ПрохождениеОбучения");
	КонецЕсли;
	
	Возврат Документы.ПрохождениеОбученияСУО.СценарийОбучения(ПрохождениеОбучения);
	
КонецФункции

Функция КоличествоОтправленныхНаПроверку(ПрохождениеОбучения) Экспорт
	
	ПрохожденияОбучения = Документы.ПрохождениеОбученияСУО.ПодчиненныеПрохождения(ПрохождениеОбучения);
	ПрохожденияОбучения.Добавить(ПрохождениеОбучения);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПопыткаВыполненияЗаданияСУО.Задание КАК Задание
		|ИЗ
		|	Документ.ПопыткаВыполненияЗаданияСУО КАК ПопыткаВыполненияЗаданияСУО
		|ГДЕ
		|	ПопыткаВыполненияЗаданияСУО.ПроверяетсяПреподавателем = &ПроверяетсяПреподавателем
		|	И ПопыткаВыполненияЗаданияСУО.ПрохождениеОбучения В(&ПрохожденияОбучения)
		|	И ПопыткаВыполненияЗаданияСУО.ДатаОтправкиНаПроверку <> &ПустаяДата
		|	И ТИПЗНАЧЕНИЯ(ПопыткаВыполненияЗаданияСУО.Задание) = ТИП(Справочник.ЗаданияСУО)
		|	И ПопыткаВыполненияЗаданияСУО.Отменено = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	Запрос.УстановитьПараметр("ПроверяетсяПреподавателем", Истина);
	Запрос.УстановитьПараметр("ПрохожденияОбучения", ПрохожденияОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Количество();	
	
КонецФункции

Функция КоличествоПроверенных(ПрохождениеОбучения) Экспорт
	
	ПрохожденияОбучения = Документы.ПрохождениеОбученияСУО.ПодчиненныеПрохождения(ПрохождениеОбучения);
	ПрохожденияОбучения.Добавить(ПрохождениеОбучения);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПопыткаВыполненияЗаданияСУО.Задание КАК Задание
		|ИЗ
		|	Документ.ПопыткаВыполненияЗаданияСУО КАК ПопыткаВыполненияЗаданияСУО
		|ГДЕ
		|	ПопыткаВыполненияЗаданияСУО.ПроверяетсяПреподавателем = &ПроверяетсяПреподавателем
		|	И ПопыткаВыполненияЗаданияСУО.ПрохождениеОбучения В(&ПрохожденияОбучения)
		|	И ПопыткаВыполненияЗаданияСУО.ПроверенПреподавателем = &ПроверенПреподавателем
		|	И ПопыткаВыполненияЗаданияСУО.Отменено = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ПроверенПреподавателем", Истина);
	Запрос.УстановитьПараметр("ПроверяетсяПреподавателем", Истина);
	Запрос.УстановитьПараметр("ПрохожденияОбучения", ПрохожденияОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Количество();	
	
КонецФункции

Функция ЗаданияНаПроверку(ПрохождениеОбучения) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткаВыполненияЗаданияСУО.Ссылка КАК Ссылка,
		|	ПопыткаВыполненияЗаданияСУО.Задание КАК Задание
		|ИЗ
		|	Документ.ПопыткаВыполненияЗаданияСУО КАК ПопыткаВыполненияЗаданияСУО
		|ГДЕ
		|	ПопыткаВыполненияЗаданияСУО.Проведен = ИСТИНА
		|	И ПопыткаВыполненияЗаданияСУО.ПрохождениеОбучения = &ПрохождениеОбучения
		|	И ПопыткаВыполненияЗаданияСУО.Задание ССЫЛКА Справочник.ЗаданияСУО
		|	И ПопыткаВыполненияЗаданияСУО.ПроверяетсяПреподавателем = ИСТИНА
		|	И ПопыткаВыполненияЗаданияСУО.ПроверенПреподавателем = ЛОЖЬ
		|	И ПопыткаВыполненияЗаданияСУО.ВозвращеноНаДоработку = ЛОЖЬ
		|	И ПопыткаВыполненияЗаданияСУО.ПопыткаЗавершена = ИСТИНА
		|	И ПопыткаВыполненияЗаданияСУО.Отменено = ЛОЖЬ";
		
	Запрос.УстановитьПараметр("ПрохождениеОбучения", ПрохождениеОбучения);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

Функция ЗаданияТребующиеПроверки(Знач Пользователи) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопыткаВыполненияЗаданияСУО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПопыткаВыполненияЗаданияСУО КАК ПопыткаВыполненияЗаданияСУО
		|ГДЕ
		|	ПопыткаВыполненияЗаданияСУО.Проведен = ИСТИНА
		|	И ПопыткаВыполненияЗаданияСУО.ПроверяетсяПреподавателем = ИСТИНА
		|	И ПопыткаВыполненияЗаданияСУО.ПроверенПреподавателем = ЛОЖЬ
		|	И ПопыткаВыполненияЗаданияСУО.ВозвращеноНаДоработку = ЛОЖЬ
		|	И ПопыткаВыполненияЗаданияСУО.Отменено = ЛОЖЬ
		|	И ПопыткаВыполненияЗаданияСУО.ПроведениеОбучения.Статус = &СтатусПроведенияАктивно
		|	И ПопыткаВыполненияЗаданияСУО.ПрохождениеОбучения.Отменено = ЛОЖЬ
		|	И ПопыткаВыполненияЗаданияСУО.ПрохождениеОбучения.Пользователь В(&Пользователи)";
	
	Запрос.УстановитьПараметр("СтатусПроведенияАктивно", Перечисления.СтатусыПроведенияОбъектовСУО.Активно);
	Запрос.УстановитьПараметр("Пользователи", Пользователи);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ОтменитьВыполнениеЗадания(ПопыткаВыполненияЗадания, ПрохождениеОбучения = Неопределено, Задание = Неопределено) Экспорт
	ДанныеПрохожденияЗадания = ОбучениеСУО.ПриПрохожденииЗадания(ПрохождениеОбучения, Задание,,,,,,,,,,ПопыткаВыполненияЗадания,,,Истина);
	ЭлектронныеРесурсыСУЗ.ОтменитьПрохождениеЗадания(ДанныеПрохожденияЗадания.ПрохождениеОбучения, ДанныеПрохожденияЗадания.Задание);					
	Возврат ДанныеПрохожденияЗадания;
КонецФункции					

Функция ВремяНачалаВыполненияНастало(Знач СвойстваЗадания) Экспорт
	
	Если ЗначениеЗаполнено(СвойстваЗадания.ДатаНачалаДоступаКЗаданию)
		И СвойстваЗадания.ДатаНачалаДоступаКЗаданию > ТекущаяДатаСеанса() Тогда		
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ВремяИстекло(Знач СвойстваЗадания, Знач ДанныеПрохожденияОбучения = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(СвойстваЗадания.ДатаОкончанияДоступаКЗаданию)
		И СвойстваЗадания.ДатаОкончанияДоступаКЗаданию < ТекущаяДатаСеанса() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Если ДанныеПрохожденияОбучения = Неопределено Тогда
		Возврат Ложь;
	Иначе		
		Возврат Документы.ПрохождениеОбученияСУО.ВремяИстекло(ДанныеПрохожденияОбучения);
	КонецЕсли;
	
КонецФункции

Функция ДатаДоступаКЗаданию(Знач ДатаДоступа, Знач ДобавленоВремениВСекундах) Экспорт
	
	Если ДобавленоВремениВСекундах > 0 Тогда
		Возврат Дата("00010101");
	КонецЕсли;
	
	Возврат ДатаДоступа;
	
КонецФункции

Функция ВыставляетсяОценка(Знач ПроведениеОбучения, Знач Задание, Знач Сценарий, Знач ВидОбучения, Знач ПрохождениеОбучения, Знач Пользователь) Экспорт
	
	Если НЕ ВидОбучения.ВыставляетсяОценка Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
				
		МассивЗаданий = Новый Массив;
		МассивЭлектронныхРесурсов = Новый Массив;
		МассивЭлектронныхКурсов = Новый Массив;
		ТаблицаНаименований	= Документы.ПроведениеОбученияСУО.ПустаяТаблицаНаименованийЗаданий();
		
		Документы.ПроведениеОбученияСУО.ЗаполнитьМассивЗаданийИЭлектронныхРесурсов(ПроведениеОбучения, МассивЗаданий, МассивЭлектронныхРесурсов, МассивЭлектронныхКурсов, ТаблицаНаименований, ВидОбучения, Задание);
		
		СтрокаТН = ТаблицаНаименований.Найти(Задание, "Задание");		
		Если СтрокаТН <> Неопределено
			И СтрокаТН.ПриОтсутствииОценкиЗаЗадание = Перечисления.ПриОтсутствииОценкиЗаЗаданиеСУО.МаксимальныйБалл Тогда			
			Возврат Истина;			
		КонецЕсли;
		
		ДанныеПрохожденияЭР = ЭлектронныеРесурсыСУЗ.ДанныеОПрохожденииЭлектронногоРесурса(Задание,,Пользователь, ПрохождениеОбучения, Задание,,ВидОбучения);
		Если ДанныеПрохожденияЭР <> Неопределено Тогда
			Возврат ДанныеПрохожденияЭР.ВыставляетсяОценка;
		КонецЕсли;
		
	Иначе
		
		СвойстваЗадания = Документы.ПроведениеОбученияСУО.СвойстваЗадания(ПроведениеОбучения, Задание, Сценарий, ВидОбучения);	
		Если СвойстваЗадания <> Неопределено Тогда
			Возврат СвойстваЗадания.ВыставляетсяОценка;
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат ВидОбучения.ВыставляетсяОценка;
	
КонецФункции

// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(ПопыткаВыполненияЗадания, ДополнительныеДанные = Неопределено) Экспорт	
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем переменные
	
	ДанныеПопыткиВыполненияЗадания = ОписаниеПопыткиВыполненияЗаданияДанные(ПопыткаВыполненияЗадания);
	
	// Удаляем старые данные
	// Здесь удаляем данные только того типа, который заполняется ниже в этой процедуре.
	// В разрезе этого документа заполняется еще тип ТипыДанныхВебКабинетаСУО.ПроверкаЗаданияОписание
	// в документе прохождения обучения. Этот тип не надо очищать, так как за него ответственен другой документ.
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.УдалитьДанные(ПопыткаВыполненияЗадания, Перечисления.ТипыДанныхВебКабинетаСУО.ВыполнениеЗаданияОписание);	
	
	// Добавляем новые данные
	
	ОбучениеОтменено = Отменено(ДанныеПопыткиВыполненияЗадания);
	
 	Если ДанныеПопыткиВыполненияЗадания.Проведен 
		И НЕ ОбучениеОтменено
		И НЕ ДанныеПопыткиВыполненияЗадания.НаОсновеЭлектронногоРесурса Тогда
		
		Зависимости = Новый Массив;
		
		// Для задания используется только описание,
		// которое содержит полную информацию о задании.
		// Краткий список выводить не требуется.
		
		ОписаниеПопыткиВыполненияЗаданияСтруктура = ОписаниеПопыткиВыполненияЗаданияСтруктура(ПопыткаВыполненияЗадания, Зависимости, ДанныеПопыткиВыполненияЗадания);
		ОписаниеПопыткиВыполненияЗадания = ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеПопыткиВыполненияЗаданияСтруктура);
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(ДанныеПопыткиВыполненияЗадания.Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.ВыполнениеЗаданияОписание, ПопыткаВыполненияЗадания, ОписаниеПопыткиВыполненияЗадания, Перечисления.ФорматыВебДанныхСУ.json);
		
		// Файлы задания
		
		Если ДанныеПопыткиВыполненияЗадания.ИспользуетсяФорматированныйДокумент Тогда
		
			ТекстЗаданияСтруктура = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(ДанныеПопыткиВыполненияЗадания.ОписаниеФорматированныйДокумент.Получить(), Строка(ДанныеПопыткиВыполненияЗадания.Задание.УникальныйИдентификатор()),, Истина, Ложь);
			
			Если ТекстЗаданияСтруктура.ЕстьВложения Тогда
				ВебКабинетСУО.ВыгрузитьФайлыФорматированногоДокументаВКаталогВебКабинета(ТекстЗаданияСтруктура.ДвоичныеДанные, ТекстЗаданияСтруктура.ИдентификаторКаталога);
			КонецЕсли;
			
		КонецЕсли;
		
		// Зависимости
		
		Если ЗначениеЗаполнено(ДанныеПопыткиВыполненияЗадания.Задание) Тогда
			Зависимости.Добавить(ДанныеПопыткиВыполненияЗадания.Задание);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеПопыткиВыполненияЗадания.Вариант) Тогда
			Зависимости.Добавить(ДанныеПопыткиВыполненияЗадания.Вариант);
		КонецЕсли;
		
		Если НЕ ОписаниеПопыткиВыполненияЗаданияСтруктура.Выполнено Тогда
					
			ПрохождениеОбученияАктуально = Документы.ПрохождениеОбученияСУО.Актуально(
				ДанныеПопыткиВыполненияЗадания.ПрохождениеОбучения);
					
			Если ПрохождениеОбученияАктуально Тогда								
				РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.ДобавитьДанные(ПопыткаВыполненияЗадания, "Документ.ПопыткаВыполненияЗаданияСУО", Зависимости);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;		
	
КонецПроцедуры

Функция ОписаниеПопыткиВыполненияЗаданияДанные(ПопыткаВыполненияЗадания) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ТребуемыеДанные = Новый Структура("	
	|Ссылка,
	|ПрохождениеОбучения,
	|ПроведениеОбучения,
	|Задание,
	|Наименование,
	|Вариант,
	|НаименованиеВарианта,
	|Баллы,
	|ЗавершеноВПроцентах,
	|ПопыткаЗавершена,
	|ТекстОтвета,
	|ПроверяетсяПреподавателем,
	|ПроверенПреподавателем,
	|КомментарийПреподавателя,
	|ТекстОписанияВарианта,
	|ТекстОписанияЗадания,
	|ДоступноПопыток,
	|Сценарий,
	|НаименованиеСценария,
	|Пользователь,
	|НаименованиеПользователя,
	|ВозвращеноНаДоработку,
	|Проведен,
	|Пользователь,	
	|КонтролироватьПрикреплениеФайлаКОтвету,
	|РодительскийСценарий,
	|НаименованиеРодительскогоСценария,
	|НаименованиеРодительскогоПроведенияОбучения,
	|ДатаОтправкиНаПроверку,
	|ПричинаВозвратаНаДоработку,
	|НаОсновеЭлектронногоРесурса,
	|ПроверившийПреподаватель,
	|СкрытьПреподавателей,
	|ПроверяющийПреподаватель,
	|ДатаПоследнейАктивностиПроверки,
	|ПроходнойБалл,
	|ИспользуетсяФорматированныйДокумент,
	|ОписаниеФорматированныйДокумент,
	|ЗатраченоВремениВСекундах,
	|Отменено,
	|ДатаНачалаДоступаКЗаданию,
	|ДатаОкончанияДоступаКЗаданию,
	|СкрытьВремяДоступаКЗаданию,
	|ДобавленоВремениВСекундах,
	|ВыставляетсяОценка",
	"Ссылка",
	"ПрохождениеОбучения",
	"ПроведениеОбучения",		
	"Задание",
	"Задание.Наименование",
	"Вариант",
	"Вариант.Наименование",
	"Баллы",
	"ЗавершеноВПроцентах",
	"ПопыткаЗавершена",
	"Описание",
	"ПроверяетсяПреподавателем",
	"ПроверенПреподавателем",
	"КомментарийПреподавателя",
	"Вариант.Описание",
	"Задание.Описание",
	"Задание.КоличествоПопытокВыполненияЗадания",
	"ПрохождениеОбучения.Сценарий",
	"ПрохождениеОбучения.Сценарий.Наименование",
	"ПрохождениеОбучения.Пользователь",
	"ПрохождениеОбучения.Пользователь.Наименование",
	"ВозвращеноНаДоработку",
	"Проведен",
	"ПрохождениеОбучения.Пользователь",
	"Задание.КонтролироватьПрикреплениеФайлаКОтвету",
	"ПрохождениеОбучения.РодительскоеПрохождение.Сценарий",
	"ПрохождениеОбучения.РодительскоеПрохождение.Сценарий.Наименование",
	"ПрохождениеОбучения.РодительскоеПрохождение.ПроведениеОбучения.Наименование",
	"ДатаОтправкиНаПроверку",
	"ПричинаВозвратаНаДоработку",
	"Задание.НаОсновеЭлектронногоРесурса",
	"ПроверившийПреподаватель",
	"ПроведениеОбучения.СкрытьПреподавателей",
	"ПроверяющийПреподаватель",
	"ДатаПоследнейАктивностиПроверки",
	"ПроходнойБалл",
	"Задание.ИспользуетсяФорматированныйДокумент",
	"Задание.ОписаниеФорматированныйДокумент",
	"ЗатраченоВремениВСекундах",
	"Отменено",
	"ДатаНачалаДоступаКЗаданию",
	"ДатаОкончанияДоступаКЗаданию",
	"СкрытьВремяДоступаКЗаданию",
	"ПрохождениеОбучения.ДобавленоВремениВСекундах",
	"ВыставляетсяОценка");
	
	ДанныеПопытки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПопыткаВыполненияЗадания, ТребуемыеДанные);	
	
	Если ТипЗнч(ДанныеПопытки.Задание) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		ДанныеПопытки.НаОсновеЭлектронногоРесурса = Истина;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеПопытки.Задание) = Тип("СправочникСсылка.ЭлектронныеКурсы") Тогда
		ДанныеПопытки.НаОсновеЭлектронногоРесурса = Ложь;
	КонецЕсли;	
	
	Если ТипЗнч(ДанныеПопытки.НаОсновеЭлектронногоРесурса) <> Тип("Булево") Тогда
		ДанныеПопытки.НаОсновеЭлектронногоРесурса = Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеПопытки.ИспользуетсяФорматированныйДокумент) <> Тип("Булево") Тогда
		ДанныеПопытки.ИспользуетсяФорматированныйДокумент = Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеПопытки.КонтролироватьПрикреплениеФайлаКОтвету) <> Тип("Булево") Тогда
		ДанныеПопытки.КонтролироватьПрикреплениеФайлаКОтвету = Ложь;
	КонецЕсли;
		
	Если ТипЗнч(ДанныеПопытки.КонтролироватьПрикреплениеФайлаКОтвету) <> Тип("Булево") Тогда
		ДанныеПопытки.КонтролироватьПрикреплениеФайлаКОтвету = Ложь;
	КонецЕсли;	
	
	Если ТипЗнч(ДанныеПопытки.Проведен) <> Тип("Булево") Тогда
		ДанныеПопытки.Проведен = Ложь;
	КонецЕсли;		
	
	Если ТипЗнч(ДанныеПопытки.Задание) = Тип("СправочникСсылка.ЗаданияСУО")
		И ТипЗнч(ДанныеПопытки.ИспользуетсяФорматированныйДокумент) = Тип("Булево")
		И ДанныеПопытки.ИспользуетсяФорматированныйДокумент Тогда
		ОписаниеЗаданияСтруктура = ОбщегоНазначенияСУ.ПредставлениеФорматированногоДокументаДляВыгрузкиHTML(
			ДанныеПопытки.ОписаниеФорматированныйДокумент.Получить(), Строка(ДанныеПопытки.Задание.УникальныйИдентификатор()),,Ложь,Истина);
		ДанныеПопытки.ТекстОписанияЗадания = СокрЛП(ОписаниеЗаданияСтруктура.ПредставлениеHTML);
	КонецЕсли;
	
	ДанныеПопытки.ДатаНачалаДоступаКЗаданию = Документы.ПопыткаВыполненияЗаданияСУО.ДатаДоступаКЗаданию(ДанныеПопытки.ДатаНачалаДоступаКЗаданию, ДанныеПопытки.ДобавленоВремениВСекундах);
	ДанныеПопытки.ДатаОкончанияДоступаКЗаданию = Документы.ПопыткаВыполненияЗаданияСУО.ДатаДоступаКЗаданию(ДанныеПопытки.ДатаОкончанияДоступаКЗаданию, ДанныеПопытки.ДобавленоВремениВСекундах);	
	
	Возврат ДанныеПопытки;
	
КонецФункции

Функция НоваяПустаяСтруктураПопыткиВыполненияЗадания() Экспорт
	
	Возврат Новый Структура("
		|ПопыткаВыполненияЗадания,
		|ПрохождениеОбучения,
		|ПроведениеОбучения,
		|Задание,
		|Наименование,
		|Вариант,
		|НаименованиеВарианта,
		|Оценка,
		|ЗавершеноВПроцентах,
		|Выполнено,
		|ПопыткаЗавершена,
		|ТекстОписанияВарианта,
		|ТекстОписанияЗадания,
		|ТекстОтвета,
		|ПроверяетсяПреподавателем,
		|ПроверенПреподавателем,
		|КомментарийПреподавателя,
		|НомерПопытки,         
		|ДоступноПопыток,
		|ФайлыЗадания,
		|ФайлыПользователя,
		|НаименованиеСценария,
		|ЭлектронноеОбучение,
		|Пользователь,
		|ВозвращеноНаДоработку,
		|ШкалаОценок,
		|КонтролироватьПрикреплениеФайлаКОтвету,
		|РодительскийСценарий,
		|НаименованиеРодительскогоСценария,
		|ДатаОтправкиНаПроверку,
		|ПричинаВозвратаНаДоработку,
		|ПричиныВозвратаНаДоработку,
		|ПроверившийПреподаватель,
		|СкрытьПреподавателей,
		|ТекущаяАктивностьПреподавателя,
		|ЗатраченоВремениВСекундах,
		|ВариантОтображенияВремени,
		|ПроходнойБалл");	
	
КонецФункции

Функция ОписаниеПопыткиВыполненияЗаданияСтруктура(ПопыткаВыполненияЗадания, Зависимости = Неопределено, ПопыткаВыполненияЗаданияДанные = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПопыткаВыполненияЗаданияДанные = Неопределено Тогда
		СвойстваВыполненияЗадания = ОписаниеПопыткиВыполненияЗаданияДанные(ПопыткаВыполненияЗадания);
	Иначе
		СвойстваВыполненияЗадания = ПопыткаВыполненияЗаданияДанные;
	КонецЕсли;
	
	// Здесь нельзя использовать свойства, зависимые от прохождения обучения,
	// так как получится циклическая зависимость. Следует получать сведения о 
	// прохождении обучения отдельным запросом. Исключение составляет свойство
	// НаименованиеРодительскогоСценария, так как оно не влияет на логику изучения.
	
	ШкалаОценки = Документы.ПроведениеОбученияСУО.ШкалаОценки(СвойстваВыполненияЗадания.ПроведениеОбучения);	
	ВидОбучения = Документы.ПроведениеОбученияСУО.ВидОбучения(СвойстваВыполненияЗадания.ПроведениеОбучения, СвойстваВыполненияЗадания.Сценарий);
	
	ЗаданиеВыполнено = Выполнено(ПопыткаВыполненияЗадания, СвойстваВыполненияЗадания.ПопыткаЗавершена, СвойстваВыполненияЗадания.ПроверяетсяПреподавателем, СвойстваВыполненияЗадания.ПроверенПреподавателем, СвойстваВыполненияЗадания.Баллы, СвойстваВыполненияЗадания.ПроходнойБалл, СвойстваВыполненияЗадания.ДатаОкончанияДоступаКЗаданию);
	ПолученаОценка = ПолученаОценка(ПопыткаВыполненияЗадания, СвойстваВыполненияЗадания.ПопыткаЗавершена, СвойстваВыполненияЗадания.ПроверяетсяПреподавателем, СвойстваВыполненияЗадания.ПроверенПреподавателем, СвойстваВыполненияЗадания.ДатаОкончанияДоступаКЗаданию, СвойстваВыполненияЗадания.ВыставляетсяОценка);
	СтатусПроцессаОбучения = Документы.ПрохождениеОбученияСУО.СтатусПроцессаОбучения(СвойстваВыполненияЗадания.ПрохождениеОбучения);
	
	СтруктураДанных = НоваяПустаяСтруктураПопыткиВыполненияЗадания();
	
	// Простые свойства
	
	СтруктураДанных.ПопыткаВыполненияЗадания = Строка(ПопыткаВыполненияЗадания.УникальныйИдентификатор());
	СтруктураДанных.ПрохождениеОбучения = Строка(СвойстваВыполненияЗадания.ПрохождениеОбучения.УникальныйИдентификатор());
	СтруктураДанных.ПроведениеОбучения = Строка(СвойстваВыполненияЗадания.ПроведениеОбучения.УникальныйИдентификатор());
	СтруктураДанных.Задание = Строка(СвойстваВыполненияЗадания.Задание.УникальныйИдентификатор());
	СтруктураДанных.Наименование = СвойстваВыполненияЗадания.Наименование;
	СтруктураДанных.Вариант = Строка(СвойстваВыполненияЗадания.Вариант.УникальныйИдентификатор());
	СтруктураДанных.НаименованиеВарианта = Строка(СвойстваВыполненияЗадания.НаименованиеВарианта);
	СтруктураДанных.ЗавершеноВПроцентах = СвойстваВыполненияЗадания.ЗавершеноВПроцентах;
	СтруктураДанных.Выполнено = ЗаданиеВыполнено;
	СтруктураДанных.ПопыткаЗавершена = СвойстваВыполненияЗадания.ПопыткаЗавершена;
	СтруктураДанных.ТекстОписанияВарианта = СвойстваВыполненияЗадания.ТекстОписанияВарианта;
	СтруктураДанных.ТекстОписанияЗадания = СвойстваВыполненияЗадания.ТекстОписанияЗадания;
	СтруктураДанных.ТекстОтвета = СвойстваВыполненияЗадания.ТекстОтвета;
	СтруктураДанных.ПроверяетсяПреподавателем = СвойстваВыполненияЗадания.ПроверяетсяПреподавателем;
	СтруктураДанных.ПроверенПреподавателем = СвойстваВыполненияЗадания.ПроверенПреподавателем;
	СтруктураДанных.КомментарийПреподавателя = СвойстваВыполненияЗадания.КомментарийПреподавателя;
	СтруктураДанных.ДоступноПопыток = СвойстваВыполненияЗадания.ДоступноПопыток;	
	СтруктураДанных.НомерПопытки = 1; 
	СтруктураДанных.ФайлыЗадания = ФайлыШаблонаЗадания(СвойстваВыполненияЗадания);
	СтруктураДанных.ФайлыПользователя = ОбучениеСУО.ПрикрепленныеФайлыКОбъектуОбучения(ПопыткаВыполненияЗадания, Истина);
	СтруктураДанных.НаименованиеСценария = СвойстваВыполненияЗадания.НаименованиеСценария;
	СтруктураДанных.ЭлектронноеОбучение = Документы.ПроведениеОбученияСУО.ЭтоЭлектронноеОбучение(СвойстваВыполненияЗадания.ПроведениеОбучения,,СвойстваВыполненияЗадания.Сценарий);
	СтруктураДанных.ВозвращеноНаДоработку = СвойстваВыполненияЗадания.ВозвращеноНаДоработку;	
	СтруктураДанных.КонтролироватьПрикреплениеФайлаКОтвету = СвойстваВыполненияЗадания.КонтролироватьПрикреплениеФайлаКОтвету;	
	СтруктураДанных.РодительскийСценарий = СвойстваВыполненияЗадания.РодительскийСценарий;	
	СтруктураДанных.НаименованиеРодительскогоСценария = ?(ЗначениеЗаполнено(СвойстваВыполненияЗадания.НаименованиеРодительскогоПроведенияОбучения), СвойстваВыполненияЗадания.НаименованиеРодительскогоПроведенияОбучения, СвойстваВыполненияЗадания.НаименованиеРодительскогоСценария);
	СтруктураДанных.ДатаОтправкиНаПроверку = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(СвойстваВыполненияЗадания.ДатаОтправкиНаПроверку);
	СтруктураДанных.ПричинаВозвратаНаДоработку = СвойстваВыполненияЗадания.ПричинаВозвратаНаДоработку;
	СтруктураДанных.СкрытьПреподавателей = СвойстваВыполненияЗадания.СкрытьПреподавателей;	
	СтруктураДанных.ЗатраченоВремениВСекундах = СвойстваВыполненияЗадания.ЗатраченоВремениВСекундах;
	СтруктураДанных.ВариантОтображенияВремени = Перечисления.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО.ЗначениеВЧисло(ВидОбучения.ВремяИзученияЭлектронныхКурсов);
	СтруктураДанных.ПроходнойБалл = СвойстваВыполненияЗадания.ПроходнойБалл;
	
	Если СвойстваВыполненияЗадания.СкрытьПреподавателей Тогда
		СтруктураДанных.ПроверившийПреподаватель = Неопределено;
	Иначе		
		СтруктураДанных.ПроверившийПреподаватель = ВебКабинетСУО.ПользовательСтруктура(СвойстваВыполненияЗадания.ПроверившийПреподаватель);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СвойстваВыполненияЗадания.ПроверяющийПреподаватель)
		И ЗначениеЗаполнено(СвойстваВыполненияЗадания.ДатаПоследнейАктивностиПроверки) Тогда
		СтруктураДанных.ТекущаяАктивностьПреподавателя = Новый Структура("Преподаватель, ДлительностьАктивности");
		СтруктураДанных.ТекущаяАктивностьПреподавателя.Преподаватель = ВебКабинетСУО.ПользовательСтруктура(СвойстваВыполненияЗадания.ПроверяющийПреподаватель);
		СтруктураДанных.ТекущаяАктивностьПреподавателя.ДлительностьАктивности = ТекущаяДатаСеанса() - СвойстваВыполненияЗадания.ДатаПоследнейАктивностиПроверки;
	Иначе
		СтруктураДанных.ТекущаяАктивностьПреподавателя = Неопределено;
	КонецЕсли;
	
	// Пользователь
	
	СтруктураДанных.Пользователь = ВебКабинетСУО.ПользовательСтруктура(СвойстваВыполненияЗадания.Пользователь, СвойстваВыполненияЗадания.НаименованиеПользователя);
	
	// Оценка
	
	СтруктураДанных.ШкалаОценок = Справочники.ШкалыОценокСУО.ШкалаОценокСтруктура(ШкалаОценки);
	
	Если ПолученаОценка Тогда
		ПолученнаяОценка = УправлениеОбучениемСУОПовтИсп.ОценкаИзБаллов(СвойстваВыполненияЗадания.Баллы, ШкалаОценки);
		СтруктураДанных.Оценка = Новый Структура("Наименование, Идентификатор", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПолученнаяОценка, "Наименование"), Строка(ПолученнаяОценка.УникальныйИдентификатор()));
	Иначе
		СтруктураДанных.Оценка = Неопределено;
	КонецЕсли;	
	
	// Причины возврата на доработку
	
	СтруктураДанных.ПричиныВозвратаНаДоработку = Справочники.ПричиныВозвратаЗаданияНаДоработкуСУО.ПричиныВозвратаСтруктура();
	
	// Удаляем колонку "ПометкаУдаления" из таблицы ПользовательскиеФайлы за ненадобностью
	
	КолонкаПометкаУдаления = СтруктураДанных.ФайлыПользователя.Колонки.Найти("ПометкаУдаления");
	
	Если КолонкаПометкаУдаления <> Неопределено Тогда
		СтруктураДанных.ФайлыПользователя.Колонки.Удалить(КолонкаПометкаУдаления);
	КонецЕсли;
	
	// Зависимости
	
	Если Зависимости <> Неопределено Тогда
		Для каждого Строка Из СтруктураДанных.ФайлыЗадания Цикл
			Зависимости.Добавить(Строка.Файл);
		КонецЦикла;
	КонецЕсли;
	
	// Завершаем
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецЕсли
